// task 1

let tempCels = prompt('Введите температуру в градусах Цельсия')

let tempFar = (9 / 5) * tempCels + 32

alert('Температура по Фаренгейту: '+ tempFar)

// task 2, 3

let name = 'Василий'

let admin = name

console.log(admin)

// task 4

console.log(1000 + "108")

// 1000108

// task 5

/*

defer - загрузка внешних скриптов в фоновом режиме и их запуск после загрузки страницы в порядке, указанном в инструкции.

async - загрузка внешних скриптов в фоновом режиме и их запуск сразу после загрузки, что быстрее загрузится, то быстрее запустится.

*/

